 export const populationQuestions = [
  ['Население превышает 100 млн', [
    "Китай", "Индия", "Соединенные Штаты Америки (США)", "Индонезия", "Пакистан", "Нигерия", "Бразилия",
    "Бангладеш", "Россия", "Мексика", "Япония", "Эфиопия", "Филиппины", "Египет", "Вьетнам"
  ]],


  /*Проверен*/
  ['Население менее 5 млн', [
    "Коста-Рика", "Мавритания", "Ирландия", "Палестина", "Центральноафриканская Республика", "Кувейт", "Хорватия",
    "Панама", "Грузия", "Эритрея", "Острова Питкэрн", "Кокосовые Острова","Ватикан","Токелау","Ниуэ","Остров Рождества","Остров Норфолк",
    "Фолклендские Острова","Монтсеррат","Сен-Пьер и Микелон","Остров Святой Елены","Уоллис и Футуна",
    "Тувалу","Науру","Ангилья","Острова Кука","Палау","Гибралтар","Сан-Марино","Виргинские Острова (Британские)",
    "Монако","Лихтенштейн","Маршалловы Острова","Южная Осетия","Фарерские Острова",
    "Северные Марианские Острова","Американское Самоа","Сент-Китс и Невис","Гренландия","Каймановы Острова",
    "Бермудские Острова","Гернси","Доминика", "Андорра", "Остров Мэн","Антигуа и Барбуда","Сейшельские Острова",
    "Тонга","Виргинские Острова (США)","Джерси","Аруба","Сент-Винсент и Гренадины","Гренада","Микронезия",
    "Кирибати","Гуам","Сент-Люсия","Самоа","Сан-Томе и Принсипи","Майотта", 
    "Новая Каледония","Французская Полинезия","Барбадос","Гвиана","Вануату","Мартиника","Исландия",
    "Белиз","Багамские Острова","Мальдивы","Гваделупа","Бруней","Приднестровье","Мальта","Кабо-Верде",
    "Суринам","Черногория","Соломоновы Острова","Люксембург","Макао","Бутан","Гайана","Коморские Острова",
    "Реюньон","Фиджи","Кипр","Джибути","Эсватини","Восточный Тимор","Маврикий","Экваториальная Гвинея",
    "Эстония","Тринидад и Тобаго","Бахрейн","Северная Македония","Латвия","Косово","Гвинея-Бисау",
    "Лесото","Словения","Габон","Ботсвана","Гамбия","Албания","Молдова","Ямайка","Литва",
    "Армения","Катар","Намибия","Пуэрто-Рико","Босния и Герцеговина","Уругвай","Монголия"
  ]],

  /*Проверен*/
  ['Население менее 1 млн', [
    "Острова Питкэрн", "Кокосовые Острова","Ватикан","Токелау","Ниуэ","Остров Рождества","Остров Норфолк",
    "Фолклендские Острова","Монтсеррат","Сен-Пьер и Микелон","Остров Святой Елены","Уоллис и Футуна",
    "Тувалу","Науру","Ангилья","Острова Кука","Палау","Гибралтар","Сан-Марино","Виргинские Острова (Британские)",
    "Монако","Лихтенштейн","Маршалловы Острова","Южная Осетия","Фарерские Острова",
    "Северные Марианские Острова","Американское Самоа","Сент-Китс и Невис","Гренландия","Каймановы Острова",
    "Бермудские Острова","Гернси","Доминика", "Андорра", "Остров Мэн","Антигуа и Барбуда","Сейшельские Острова",
    "Тонга","Виргинские Острова (США)","Джерси","Аруба","Сент-Винсент и Гренадины","Гренада","Микронезия",
    "Кирибати","Гуам","Сент-Люсия","Самоа","Сан-Томе и Принсипи", "Майотта", 
    "Новая Каледония","Французская Полинезия","Барбадос","Гвиана","Вануату","Мартиника","Исландия",
    "Белиз","Багамские Острова","Мальдивы","Гваделупа","Бруней","Приднестровье","Мальта","Кабо-Верде",
    "Суринам","Черногория","Соломоновы Острова","Люксембург","Макао","Бутан","Гайана","Коморские Острова",
    "Реюньон","Фиджи","Кипр","Джибути"
  ]],

  /*Проверен*/
  ['Республика с населением более 50 млн человек', [
    "Индия","Соединенные Штаты Америки (США)", "Индонезия", "Пакистан", "Нигерия", "Бразилия", "Бангладеш",
    "Россия", "Мексика", "Эфиопия", "Филиппины", "Демократическая Республика Конго", "Египет", "Турция", "Германия", "Франция",
    "Южно-Африканская Республика", "Танзания", "Италия", "Кения", "Южная Корея"
  ]]
]