 /*             Список вопросов 
 
 Формат: Массив, где первый элемент - Текст вопроса на русском, далее ответы (страны - их коды) 
 
 */
/*export const questions = [
    /*Население
    PopulationAbove20M = ['Население превышает 20 млн'],
    PopulationAbove100M = ['Население превышает 100 млн'],
    PopulationUnder10M = ['Население менее 10 млн'],
    PopulationUnder1M = ['Население менее 1 млн'],
    RepublicWithPopulationOver50M = ['Республика с населением более 50 млн человек'],

    /*Площадь
    AreaAbove1M = ['Площадь более 1млн км^2'],
    AreaUnder100k = ['Площадь менее 100тыс км^2'],

    /*Деньги
    GDPAbove1000B = ['ВВП превышает 1000млрд $'],
    GDPPerCitizenAbove50k = ['ВВП на душу населения превышает 50тыс $'],
    GDPPerCitizenUnder500 = ['ВВП на душу населения менее 500 $'],

    /*Границы
    Islands = ['Не материковая страна (островная)'],
    BorderNeighbourLow = ['Имеет не более 2 граничащих стран'],
    LengthOFCoastlineAbove5k =['Береговая линия более 5тыс км'],
    HasNoCoastline = ['Не имеет выхода к морю'],

    /*Флаги
    FlagThreeColors = ['Флаг содержит ровно три цвета'],
    HasRedAndWhiteFlagOnly = ['Флаг состоит только из красного и белого цветов'],

    /*Правление
    Monarchy = ['Является монархией (включая абсолютные и конституционные)'],

    /*Буквы
    StartsWithLetterK = ['Название страны начинается на букву "К"'],
    StartsWithLetterB = ['Название страны начинается на букву "Б"'],
    StartsWithLetterP = ['Название страны начинается на букву "П"'],
    StartsWithLetterS = ['Название страны начинается на букву "С"'],

    /*Полушарии
    InSouthernHemisphere = ['Полностью расположена в южном полушарии'],
    InNorthernHemisphereOnly = ['Полностью расположена в северном полушарии']
/*];*/

export const questions = [
  /* Население */
  
  /*Проверен*/
  ['Население превышает 100 млн', [
    "Китай", "Индия", "Соединенные Штаты Америки (США)", "Индонезия", "Пакистан", "Нигерия", "Бразилия",
    "Бангладеш", "Россия", "Мексика", "Япония", "Эфиопия", "Филиппины", "Египет", "Вьетнам"
  ]],


  /*Проверен*/
  ['Население менее 5 млн', [
    "Коста-Рика", "Мавритания", "Ирландия", "Палестина", "Центральноафриканская Республика", "Кувейт", "Хорватия",
    "Панама", "Грузия", "Эритрея", "Острова Питкэрн", "Кокосовые Острова","Ватикан","Токелау","Ниуэ","Остров Рождества","Остров Норфолк",
    "Фолклендские Острова","Монтсеррат","Сен-Пьер и Микелон","Остров Святой Елены","Уоллис и Футуна",
    "Тувалу","Науру","Ангилья","Острова Кука","Палау","Гибралтар","Сан-Марино","Виргинские Острова (Британские)",
    "Монако","Лихтенштейн","Маршалловы Острова","Южная Осетия","Фарерские Острова",
    "Северные Марианские Острова","Американское Самоа","Сент-Китс и Невис","Гренландия","Каймановы Острова",
    "Бермудские Острова","Гернси","Доминика", "Андорра", "Остров Мэн","Антигуа и Барбуда","Сейшельские Острова",
    "Тонга","Виргинские Острова (США)","Джерси","Аруба","Сент-Винсент и Гренадины","Гренада","Микронезия",
    "Кирибати","Гуам","Сент-Люсия","Самоа","Сан-Томе и Принсипи","Майотта", 
    "Новая Каледония","Французская Полинезия","Барбадос","Гвиана","Вануату","Мартиника","Исландия",
    "Белиз","Багамские Острова","Мальдивы","Гваделупа","Бруней","Приднестровье","Мальта","Кабо-Верде",
    "Суринам","Черногория","Соломоновы Острова","Люксембург","Макао","Бутан","Гайана","Коморские Острова",
    "Реюньон","Фиджи","Кипр","Джибути","Эсватини","Восточный Тимор","Маврикий","Экваториальная Гвинея",
    "Эстония","Тринидад и Тобаго","Бахрейн","Северная Македония","Латвия","Косово","Гвинея-Бисау",
    "Лесото","Словения","Габон","Ботсвана","Гамбия","Албания","Молдова","Ямайка","Литва",
    "Армения","Катар","Намибия","Пуэрто-Рико","Босния и Герцеговина","Уругвай","Монголия"
  ]],

  /*Проверен*/
  ['Население менее 1 млн', [
    "Острова Питкэрн", "Кокосовые Острова","Ватикан","Токелау","Ниуэ","Остров Рождества","Остров Норфолк",
    "Фолклендские Острова","Монтсеррат","Сен-Пьер и Микелон","Остров Святой Елены","Уоллис и Футуна",
    "Тувалу","Науру","Ангилья","Острова Кука","Палау","Гибралтар","Сан-Марино","Виргинские Острова (Британские)",
    "Монако","Лихтенштейн","Маршалловы Острова","Южная Осетия","Фарерские Острова",
    "Северные Марианские Острова","Американское Самоа","Сент-Китс и Невис","Гренландия","Каймановы Острова",
    "Бермудские Острова","Гернси","Доминика", "Андорра", "Остров Мэн","Антигуа и Барбуда","Сейшельские Острова",
    "Тонга","Виргинские Острова (США)","Джерси","Аруба","Сент-Винсент и Гренадины","Гренада","Микронезия",
    "Кирибати","Гуам","Сент-Люсия","Самоа","Сан-Томе и Принсипи", "Майотта", 
    "Новая Каледония","Французская Полинезия","Барбадос","Гвиана","Вануату","Мартиника","Исландия",
    "Белиз","Багамские Острова","Мальдивы","Гваделупа","Бруней","Приднестровье","Мальта","Кабо-Верде",
    "Суринам","Черногория","Соломоновы Острова","Люксембург","Макао","Бутан","Гайана","Коморские Острова",
    "Реюньон","Фиджи","Кипр","Джибути"
  ]],

  /*Проверен*/
  ['Республика с населением более 50 млн человек', [
    "Индия","Соединенные Штаты Америки (США)", "Индонезия", "Пакистан", "Нигерия", "Бразилия", "Бангладеш",
    "Россия", "Мексика", "Эфиопия", "Филиппины", "Демократическая Республика Конго", "Египет", "Турция", "Германия", "Франция",
    "Южно-Африканская Республика", "Танзания", "Италия", "Кения", "Южная Корея"
  ]],

  /* Площадь */
  // Проверен
  ['Площадь более 1 млн км²', [
    "Россия", "Канада", "Соединенные Штаты Америки (США)", "Китай", "Бразилия", "Австралия", "Индия", "Аргентина", 
    "Казахстан", "Алжир", "Демократическая Республика Конго", "Саудовская Аравия", "Мексика", "Индонезия", "Судан", "Ливия", "Иран", 
    "Монголия", "Перу", "Чад", "Нигер", "Ангола", "Мали", "Южно-Африканская Республика", "Колумбия", "Эфиопия",
    "Боливия", "Мавритания", "Египет" 
  ]],

  // Проверен
  ['Площадь менее 10 тыс км²', [
    "Кипр", "Пуэрто-Рико", "Палестина", "Бруней", "Тринидад и Тобаго", "Французская Полинезия", "Кабо-Верде",
    "Южная Георгия и Южные Сандвичевы Острова", "Самоа", "Люксембург", "Коморские Острова", "Маврикий",
    "Виргинские Острова (США)", "Аландские Острова", "Фарерские Острова", "Гонконг", "Сан-Томе и Принсипи",
    "Кирибати", "Бахрейн", "Доминика", "Тонга", "Сингапур", "Микронезия", "Сент-Люсия", "Гуам", "Андорра",
    "Северные Марианские Острова", "Палау", "Сейшельские Острова", "Антигуа и Барбуда", "Барбадос",
    "Острова Херд и Макдональд", "Остров Святой Елены", "Сент-Винсент и Гренадины", "Гренада", "Мальта",
    "Мальдивы", "Каймановы Острова", "Сент-Китс и Невис", "Ниуэ", "Сен-Пьер и Микелон", "Острова Кука",
    "Американское Самоа", "Маршалловы Острова", "Аруба", "Лихтенштейн", "Виргинские Острова (Британские)",
    "Уоллис и Футуна", "Остров Рождества", "Джерси", "Монтсеррат", "Ангилья", "Гернси", "Сан-Марино",
    "Британская территория в Индийском океане", "Бермудские Острова","Острова Питкэрн", "Норфолк",
    "Макао", "Тувалу", "Науру","Кокосовые Острова", "Токелау", "Гибралтар", "Монако", "Ватикан"  
  ]],

  /* Деньги */
  // Проверен
  ['ВВП превышает 1000 млрд $', [
    "Соединенные Штаты Америки (США)", "Китай", "Германия", "Индия", "Япония",  "Великобритания", "Франция",
    "Италия", "Канада", "Бразилия", "Россия", "Испания", "Южная Корея", "Австралия", "Мексика", "Турция",
    "Индонезия", "Нидерланды", "Саудовская Аравия"
  ]],

  // Проверен
  ['ВВП на душу населения превышает 50 тыс $', [
    "Лихтенштейн", "Люксембург", "Ирландия", "Швейцария", "Исландия", "Сингапур", "Норвегия", "Соединенные Штаты Америки (США)",
    "Дания", "Макао", "Нидерланды", "Катар", "Австралия", "Сан-Марино", "Швеция", "Австрия", "Бельгия",
    "Израиль", "Германия", "Гонконг", "Великобритания", "Финляндия", "Канада", "ОАЭ"
  ]],

  // Проверен
  ['ВВП на душу населения менее 1000 $', [
    "Бурунди", "Йемен", "Афганистан", "Сьерра-Леоне", "Южный Судан", "Центральноафриканская Республика",
    "Мадагаскар", "Мозамбик", "Нигер", "Северная Корея", "Сомали", "Малави", "Либерия",
    "Демократическая Республика Конго", "Эритрея", "Гвинея-Бисау", "Судан", "Гамбия", "Мали",
    "Сирия", "Буркина-Фасо", "Того", "Чад", "Эфиопия", "Руанда", "Уганда", "Таджикистан"     
  ]],

  /* Границы */
  ['Не материковая страна (островная)', [
    "Япония", "Индонезия", "Филиппины", "Исландия", "Мадагаскар", "Шри-Ланка",
    "Новая Зеландия", "Куба", "Великобритания", "Ирландия", "Фиджи", "Бахрейн", "Мальта"
  ]],

  ['Имеет не более 2 граничащих стран', [
    "Канада", "Португалия", "Южная Корея", "Гамбия", "Дания", "Гаити", "Доминиканская Республика"
  ]],

  ['Береговая линия более 5 тыс км', [
    "Канада", "Россия", "Индонезия", "Австралия", "Соединенные Штаты Америки (США)", "Норвегия", "Филиппины", "Япония", "Новая Зеландия"
  ]],

  ['Не имеет выхода к морю', [
    "Швейцария", "Австрия", "Чехия", "Венгрия", "Словакия", "Сербия", "Боливия",
    "Парагвай", "Монголия", "Непал", "Афганистан", "Чад", "Нигер", "Мали"
  ]],

  /* Флаги */
  ['Флаг содержит ровно три цвета', [
    "Россия", "Франция", "Германия", "Италия", "Нидерланды", "Румыния",
    "Болгария", "Мексика", "Индия", "Армения", "Азербайджан", "Колумбия"
  ]],

  ['Флаг состоит только из красного и белого цветов', [
    "Япония", "Канада", "Польша", "Дания", "Швейцария", "Монако", "Индонезия", "Сингапур"
  ]],

  /* Правление */
  ['Является монархией', [
    "Великобритания", "Испания", "Швеция", "Норвегия", "Дания", "Нидерланды", "Бельгия",
    "Люксембург", "Япония", "Таиланд", "Саудовская Аравия", "Марокко", "Бахрейн", "Катар", "Кувейт", "Оман", "Иордания", "Малайзия"
  ]],

  /* Буквы */
  // Проверен
  ['Название страны начинается на букву "К"', [
    "Кабо-Верде", "Казахстан", "Каймановы Острова", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр",
    "Кирибати", "Китай", "Кокосовые Острова", "Колумбия", "Коморские Острова", "Демократическая Республика Конго", "Республика Конго",
    "Косово", "Коста-Рика","Кот-д'Ивуар", "Куба", "Кувейт", "Острова Кука", "Кыргызстан",
  ]],

  // Проверен
  ['Название страны начинается на букву "Б"', [
  "Багамские Острова", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия", "Бенин",
  "Бермудские Острова", "Болгария", "Боливия", "Босния и Герцеговина",
  "Ботсвана", "Бразилия", "Британская территория в Индийском океане", "Бруней", "Буркина-Фасо", "Бурунди", "Бутан"
  ]],

  // Проверен
  ['Название страны начинается на букву "П"', [
  "Пакистан", "Палау", "Палестина", "Панама", "Папуа — Новая Гвинея", "Парагвай", "Перу",
  "Питкэрн", "Польша", "Португалия", "Приднестровье", "Пуэрто-Рико", "Французская Полинезия"
  ]],

  //Проверен
  ['Название страны начинается на букву "С"', [
  "Северная Корея", "Северная Македония", "Сальвадор", "Самоа", "Сан-Марино",
  "Сан-Томе и Принсипи", "Саудовская Аравия", "Эсватини", "Свальбард", "Северные Марианские Острова",
  "Сейшельские Острова", "Сен-Пьер и Микелон", "Сенегал", "Сент-Винсент и Гренадины", "Сент-Китс и Невис",
  "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соединенные Штаты Америки (США)", "Соломоновы Острова",
  "Сомали", "Сомалиленд", "Судан", "Суринам", "Сьерра-Леоне", "Северный Кипр"
  ]],

  /* Полушария */
  ['Полностью расположена в южном полушарии', [
    "Австралия", "Новая Зеландия", "Папуа — Новая Гвинея", "Фиджи", "Соломоновы Острова",
    "Тонга", "Самоа", "Вануату", "Мадагаскар", "Ботсвана", "Намибия", "Южная Африка"
  ]],

  ['Полностью расположена в северном полушарии', [
    "Россия", "Канада", "Соединенные Штаты Америки (США)", "Китай", "Япония", "Германия", "Франция", "Польша",
    "Италия", "Украина", "Казахстан", "Монголия", "Саудовская Аравия", "Иран"
  ]]
];
